CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_fmc.c
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    if(FMC_READY == fmc_state){
        /* set the PG bit to start program */
        FMC_SECCTL |= FMC_SECCTL_SECPG;

        for(uint32_t i = 0U; i < size; i++)
        {
            REG32(address) = data[i];
            address += 4U;
        }

        /* reset the PG bit */
        FMC_SECCTL &= ~FMC_SECCTL_SECPG;
    }
#else /* __ARM_FEATURE_CMSE */
    if(FMC_READY == fmc_state){
        /* set the PG bit to start program */
        FMC_CTL |= FMC_CTL_PG;

        for(uint32_t i = 0U; i < size; i++)
        {
            REG32(address) = data[i];
            address += 4U;
        }

        /* reset the PG bit */
        FMC_CTL &= ~FMC_CTL_PG;
    }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

    /* return the FMC state */
    return fmc_state;
}
#endif /* GD32W515PI and GD32W515TX */

/*!
    \brief      enable SRAM1 reset automatically function 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sram1_reset_enable(void)
{
#ifdef GD32W515P0
    FMC_OBR |= (uint32_t)(FMC_OBR_SRAM1_RST);
#else
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        FMC_OBR |= (uint32_t)(FMC_OBR_SRAM1_RST);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
#endif /* GD32W515PI and GD32W515TX */
}

/*!
    \brief      disable SRAM1 reset automatically function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void sram1_reset_disable(void)
{
#ifdef GD32W515P0
    FMC_OBR &= ~(uint32_t)(FMC_OBR_SRAM1_RST);
#else
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        FMC_OBR &= ~(uint32_t)(FMC_OBR_SRAM1_RST);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
#endif /* GD32W515PI and GD32W515TX */
}

/*!
    \brief      enable the privileged access
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_privilege_enable(void)
{
    FMC_PRIVCFG |= (uint32_t)(FMC_PRIVCFG_FMC_PRIV);
}
/*!
    \brief      disable the privileged access
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_privilege_disable(void)
{
    FMC_PRIVCFG &= ~(uint32_t)(FMC_PRIVCFG_FMC_PRIV);
}

/*!
    \brief      unlock the option bytes operation
                it is better to used in pairs with ob_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(RESET == (FMC_CTL & FMC_CTL_OBWEN)){
        /* write the FMC ob unlock key */
        FMC_OBKEY = UNLOCK_KEY0;
        FMC_OBKEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option bytes operation
                it is better to used in pairs with ob_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_lock(void)
{
    /* reset the OBWEN bit */
    FMC_CTL &= ~FMC_CTL_OBWEN;
}

#ifndef GD32W515P0
/*!
    \brief      send option bytes modification start command
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_start(void)
{
    /* set the OB_START bit in FMC_CTL register to start option bytes modification */
    FMC_CTL |= (FMC_CTL_OBSTART | FMC_CTL_OBWEN);
}

/*!
    \brief      reload option bytes
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reload(void)
{
    /* set the FMC_CTL_OBRLD bit in FMC_CTL register to reload option bytes */
    FMC_CTL |= FMC_CTL_OBRLD;
}

/*!
    \brief      configure security protection
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_spc: specify security protection
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_SPC_P0_5: security protection level 0.5
      \arg        FMC_SPC_P1: security protection level 1
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_security_protection_config(uint8_t ob_spc)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        FMC_OBR &= FMC_OBR_SPC_MASK;
        FMC_OBR |= ob_spc;
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      enable trustzone
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_trustzone_enable(void)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        FMC_OBR |= (uint32_t)(FMC_OBR_TZEN);
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      disable trustzone
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus ob_trustzone_disable(void)
{
    uint32_t reg;
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if((ob_security_protection_flag_get(OB_FLAG_SPC1)) || (ob_security_protection_flag_get(OB_FLAG_SPC0_5))){
        /* TZEN bit must be cleared at the same time that flash security protection return to unprotected */
        reg = FMC_OBR;
        reg &= ~(uint32_t)(FMC_OBR_TZEN);
        reg &= FMC_OBR_SPC_MASK;
        reg |= (uint32_t)(FMC_NSPC);

        if(FMC_READY == fmc_state){
            FMC_OBR = reg;
            /* start option bytes modification */
            FMC_CTL |= FMC_CTL_OBSTART;
        }
        return SUCCESS;
    }else{
        return ERROR;
    }
}

/*!
    \brief      program option bytes USER
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_user: option bytes user value
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_user_write(uint16_t ob_user)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        FMC_OBUSER &= FMC_OBUSER_MASK;
        FMC_OBUSER |= ob_user ;
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure write protection pages
    \param[in]  wrp_spage: start page of write protection area, 0~512
    \param[in]  wrp_epage: end page of write protection area, 0~512
    \param[in]  wrp_register_index
                only one parameter can be selected which are shown as below:
      \arg        OBWRP_INDEX0: option byte write protection area register 0
      \arg        OBWRP_INDEX1: option byte write protection area register 1
    \param[out] none
    \retval     none
*/
fmc_state_enum ob_write_protection_config(uint32_t wrp_spage, uint32_t wrp_epage, uint32_t wrp_register_index)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        switch(wrp_register_index){
        case OBWRP_INDEX0:
            FMC_OBWRP0 = 0U;
            FMC_OBWRP0 |= wrp_spage;
            FMC_OBWRP0 |= wrp_epage <<FMC_EPAGE_OFFSET;
            break;
        case OBWRP_INDEX1:
            FMC_OBWRP1 = 0U;
            FMC_OBWRP1 |= wrp_spage;
            FMC_OBWRP1 |= wrp_epage <<FMC_EPAGE_OFFSET;
            break;
        default :
            break;
        }
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure secure mark pages
    \param[in]  secm_spage: start page of secure mark area, 0~0x03FF
    \param[in]  secm_epage: end page of secure mark area, 0~0x03FF
    \param[in]  secm_register_index
                only one parameter can be selected which are shown as below:
      \arg        SECM_INDEX0: secure mark configuration register 0
      \arg        SECM_INDEX1: secure mark configuration register 1
      \arg        SECM_INDEX2: secure mark configuration register 2
      \arg        SECM_INDEX3: secure mark configuration register 3
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
void ob_secmark_config(uint32_t secm_spage, uint32_t secm_epage, uint32_t secm_register_index)
{
    fmc_state_enum fmc_state;

    switch(secm_register_index){
    case SECM_INDEX0:
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state){
            FMC_SECMCFG0 = 0U;
            FMC_SECMCFG0 |= secm_spage;
            FMC_SECMCFG0 |= secm_epage <<FMC_EPAGE_OFFSET;
            /* start option bytes modification */
            FMC_CTL |= FMC_CTL_OBSTART;
        }
        break;
    case SECM_INDEX1:
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state){
            FMC_SECMCFG1 = 0U;
            FMC_SECMCFG1 |= secm_spage;
            FMC_SECMCFG1 |= secm_epage <<FMC_EPAGE_OFFSET;
            /* start option bytes modification */
            FMC_CTL |= FMC_CTL_OBSTART;
        }
        break;
    case SECM_INDEX2:
        FMC_SECMCFG2 = 0U;
        FMC_SECMCFG2 |= secm_spage;
        FMC_SECMCFG2 |= secm_epage <<FMC_EPAGE_OFFSET;
        break;
    case SECM_INDEX3:
        FMC_SECMCFG3 = 0U;
        FMC_SECMCFG3 |= secm_spage;
        FMC_SECMCFG3 |= secm_epage <<FMC_EPAGE_OFFSET;
        break;
    default :
        break;
    }
}

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/*!
    \brief      enable DMP region access right
    \param[in]  dmp_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     none
*/
void ob_dmp_access_enable(uint32_t dmp_register_index)
{
    nvic_system_reset();
}

/*!
    \brief      disable DMP region access right
    \param[in]  DMP_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     none
*/
void ob_dmp_access_disable(uint32_t DMP_register_index)
{
    switch(DMP_register_index){
    case DMP_INDEX0:
        FMC_DMPCTL |= (uint32_t)(FMC_DMPCTL_DMP0_ACCCFG);
        break;
    case DMP_INDEX1:
        FMC_DMPCTL |= (uint32_t)(FMC_DMPCTL_DMP1_ACCCFG);
        break;
    default :
        break;
    }
}
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/*!
    \brief      configure DMP pages
    \param[in]  dmp_epage: end page of secure DMP mark area 0~0x03FF
    \param[in]  dmp_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus ob_dmp_config(uint32_t dmp_epage, uint32_t dmp_register_index)
{
    uint32_t secm_epage;
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        switch(dmp_register_index){
        case DMP_INDEX0:
            secm_epage = FMC_SECMCFG0 & FMC_SECM_EPAGE_MASK;
            if(secm_epage > dmp_epage){
                FMC_DMP0 = 0U;
                FMC_DMP0 |= dmp_epage <<FMC_EPAGE_OFFSET;
            }else{
                return ERROR;
            }
            break;
        case DMP_INDEX1:
            secm_epage = FMC_SECMCFG1 & FMC_SECM_EPAGE_MASK;
            if(secm_epage > dmp_epage){
                FMC_DMP1 = 0U;
                FMC_DMP1 |= dmp_epage <<FMC_EPAGE_OFFSET;
            }else{
                return ERROR;
            }
            break;
        default :
            break;
        }
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
    }

    return SUCCESS;
}

/*!
    \brief      enable DMP function
    \param[in]  DMP_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_dmp_enable(uint32_t dmp_register_index)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        switch(dmp_register_index){
        case DMP_INDEX0:
            FMC_DMP0 |= (uint32_t)(FMC_DMP0_DMP0EN);
            break;
        case DMP_INDEX1:
            FMC_DMP1 |= (uint32_t)(FMC_DMP1_DMP1EN);
            break;
        default :
            break;
        }
        /* start option bytes modification */
        FMC_CTL |= FMC_CTL_OBSTART;
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      disable DMP function
    \param[in]  DMP_register_index
                only one parameter can be selected which are shown as below:
      \arg        DMP_INDEX0: secure DMP configuration register 0
      \arg        DMP_INDEX1: secure DMP configuration register 1
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OBERR: option bytes error
      \arg        FMC_SECERR: secure program error, only available in secure mode
*/
fmc_state_enum ob_dmp_disable(uint32_t dmp_register_index)
{
    fmc_state_enum fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        switch(dmp_register_index){
        case DMP_INDEX0:
            FMC_DMP0 &= (uint32_t)(~FMC_DMP0_DMP0EN);
            break;
        case DMP_INDEX1:
            FMC_DMP1 &= (uint32_t)(~FMC_DMP1_DMP1EN);
            break;
        default :
            break;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure NO-RTDEC pages
    \param[in]  nodec_spage: start page of NO-RTDEC area, 0~0x03FF
    \param[in]  nodec_epage: end page of NO-RTDEC area, 0~0x03FF
    \param[in]  nodec_register_index
                only one parameter can be selected which are shown as below:
      \arg        NODEC_INDEX0: NO-RTDEC region register 0
      \arg        NODEC_INDEX1: NO-RTDEC region register 1
      \arg        NODEC_INDEX2: NO-RTDEC region register 2
      \arg        NODEC_INDEX3: NO-RTDEC region register 3
    \param[out] none
    \retval     none
*/
void fmc_no_rtdec_config(uint32_t nodec_spage, uint32_t nodec_epage, uint32_t nodec_register_index)
{
    switch(nodec_register_index){
    case NODEC_INDEX0:
        FMC_NODEC0 = 0U;
        FMC_NODEC0 |= nodec_spage;
        FMC_NODEC0 |= nodec_epage <<FMC_EPAGE_OFFSET;
        break;
    case NODEC_INDEX1:
        FMC_NODEC1 = 0U;
        FMC_NODEC1 |= nodec_spage;
        FMC_NODEC1 |= nodec_epage <<FMC_EPAGE_OFFSET;
        break;
    case NODEC_INDEX2:
        FMC_NODEC2 = 0U;
        FMC_NODEC2 |= nodec_spage;
        FMC_NODEC2 |= nodec_epage <<FMC_EPAGE_OFFSET;
        break;
    case NODEC_INDEX3:
        FMC_NODEC3 = 0U;
        FMC_NODEC3 |= nodec_spage;
        FMC_NODEC3 |= nodec_epage <<FMC_EPAGE_OFFSET;
        break;
    default :
        break;
    }
}
#endif /* GD32W515PI and GD32W515TX */

/*!
    \brief      configure offset region
    \param[in]  of_spage: start page of offset region, 0~0x1FFF
    \param[in]  of_epage: end page of offset region, 0~0x1FFF
    \param[out] none
    \retval     none
*/
void fmc_offset_region_config(uint32_t of_spage, uint32_t of_epage)
{
    FMC_OFRG = 0U;
    FMC_OFRG |= (uint32_t)(of_spage);
    FMC_OFRG |= (uint32_t)(of_epage <<FMC_EPAGE_OFFSET);
}

/*!
    \brief      configure offset value
    \param[in]  of_value: offset value, 0~0x1FFF
    \param[out] none
    \retval     none
*/
void fmc_offset_value_config(uint32_t of_value)
{
    FMC_OFVR = 0U;
    FMC_OFVR |= (uint32_t)(of_value);
}

